Revit 2027 API
BuiltInFailures.LooseDimensionFailures.LooseDimensionsForCurtainWall Property
 Switching wall type to Family Curtain Wall. All Dimension References to the side faces of the Wall will be deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LooseDimensionsForCurtainWall { get; }
Public Shared ReadOnly Property LooseDimensionsForCurtainWall As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LooseDimensionsForCurtainWall {
	FailureDefinitionId^ get ();
}
static member LooseDimensionsForCurtainWall : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.LooseDimensionFailures Class
Autodesk.Revit.DB Namespace